tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1613_tdd.h
#define IOCAN4                        522
#define IOCAN5                        523
#define IOCAF0                        524
#define IOCAF                         525
#define IOCAF1                        526
#define IOCAF2                        527
#define IOCAF3                        528
#define IOCAF4                        529
#define IOCAF5                        530
#define IOCCP                         531
#define IOCCP0                        532
#define IOCCP1                        533
#define IOCCP2                        534
#define IOCCP3                        535
#define IOCCP4                        536
#define IOCCP5                        537
#define IOCCN                         538
#define IOCCN0                        539
#define IOCCN1                        540
#define IOCCN2                        541
#define IOCCN3                        542
#define IOCCN4                        543
#define IOCCN5                        544
#define IOCCF                         545
#define IOCCF0                        546
#define IOCCF1                        547
#define IOCCF2                        548
#define IOCCF3                        549
#define IOCCF4                        550
#define IOCCF5                        551
#define T4TMR                         552
#define TMR4                          553
#define T4PR                          554
#define PR4                           555
#define T4CON                         556
#define T4OUTPS0                      557
#define T4CON_OUTPS                   558
#define T4OUTPS                       559
#define T4CON_OUTPS0                  560
#define T4OUTPS1                      561
#define T4CON_OUTPS1                  562
#define T4CON_OUTPS2                  563
#define T4OUTPS2                      564
#define T4OUTPS3                      565
#define T4CON_OUTPS3                  566
#define T4CON_CKPS0                   567
#define T4CKPS0                       568
#define T4CON_CKPS                    569
#define T4CKPS                        570
#define T4CKPS1                       571
#define T4CON_CKPS1                   572
#define T4CKPS2                       573
#define T4CON_CKPS2                   574
#define T4ON                          575
#define T4CON_ON                      576
#define TMR4ON                        577
#define T4HLT                         578
#define T4MODE                        579
#define T4HLT_MODE                    580
#define T4HLT_MODE0                   581
#define T4MODE0                       582
#define T4HLT_MODE1                   583
#define T4MODE1                       584
#define T4HLT_MODE2                   585
#define T4MODE2                       586
#define T4HLT_MODE3                   587
#define T4MODE3                       588
#define T4HLT_CKSYNC                  589
#define T4CKSYNC                      590
#define T4HLT_CKPOL                   591
#define T4CKPOL                       592
#define T4PSYNC                       593
#define T4HLT_PSYNC                   594
#define T4CLKCON                      595
#define T4CS0                         596
#define T4CS                          597
#define T4CS1                         598
#define T4CS2                         599
#define T4RST                         600
#define T4RSEL0                       601
#define T4RSEL                        602
#define T4RST_RSEL                    603
#define T4RST_RSEL0                   604
#define T4RSEL1                       605
#define T4RST_RSEL1                   606
#define T4RSEL2                       607
#define T4RST_RSEL2                   608
#define T4RSEL3                       609
#define T4RST_RSEL3                   610
#define T6TMR                         611
#define TMR6                          612
#define T6PR                          613
#define PR6                           614
#define T6CON                         615
#define T6CON_OUTPS0                  616
#define T6OUTPS                       617
#define T6CON_OUTPS                   618
#define T6OUTPS0                      619
#define T6CON_OUTPS1                  620
#define T6OUTPS1                      621
#define T6CON_OUTPS2                  622
#define T6OUTPS2                      623
#define T6CON_OUTPS3                  624
#define T6OUTPS3                      625
#define T6CON_CKPS0                   626
#define T6CKPS                        627
#define T6CKPS0                       628
#define T6CON_CKPS                    629
#define T6CON_CKPS1                   630
#define T6CKPS1                       631
#define T6CON_CKPS2                   632
#define T6CKPS2                       633
#define TMR6ON                        634
#define T6ON                          635
#define T6CON_ON                      636
#define T6HLT                         637
#define T6HLT_MODE0                   638
#define T6HLT_MODE                    639
#define T6MODE0                       640
#define T6MODE                        641
#define T6HLT_MODE1                   642
#define T6MODE1                       643
#define T6MODE2                       644
#define T6HLT_MODE2                   645
#define T6HLT_MODE3                   646
#define T6MODE3                       647
#define T6CKSYNC                      648
#define T6HLT_CKSYNC                  649
#define T6CKPOL                       650
#define T6HLT_CKPOL                   651
#define T6PSYNC                       652
#define T6HLT_PSYNC                   653
#define T6CLKCON                      654
#define T6CS                          655
#define T6CS0                         656
#define T6CS1                         657
#define T6CS2                         658
#define T6RST                         659
#define T6RST_RSEL                    660
#define T6RST_RSEL0                   661
#define T6RSEL                        662
#define T6RSEL0                       663
#define T6RST_RSEL1                   664
#define T6RSEL1                       665
#define T6RSEL2                       666
#define T6RST_RSEL2                   667
#define T6RST_RSEL3                   668
#define T6RSEL3                       669
#define CWG1DBR0                      670
#define CWG1DBR                       671
#define DBR                           672
#define DBR0                          673
#define CWG1DBR1                      674
#define DBR1                          675
#define CWG1DBR2                      676
#define DBR2                          677
#define CWG1DBR3                      678
#define DBR3                          679
#define CWG1DBR4                      680
#define DBR4                          681
#define CWG1DBR5                      682
#define DBR5                          683
#define CWG1DBF                       684
#define CWG1DBF0                      685
#define DBF                           686
#define DBF0                          687
#define CWG1DBF1                      688
#define DBF1                          689
#define CWG1DBF2                      690
#define DBF2                          691
#define CWG1DBF3                      692
#define DBF3                          693
#define CWG1DBF4                      694
#define DBF4                          695
#define DBF5                          696
#define CWG1DBF5                      697
#define CWG1AS0                       698
#define CWG1LSAC                      699
#define LSAC                          700
#define LSAC0                         701
#define CWG1LSAC0                     702
#define LSAC1                         703
#define CWG1LSAC1                     704
#define LSBD0                         705
#define CWG1LSBD0                     706
#define LSBD                          707
#define CWG1LSBD                      708
#define LSBD1                         709
#define CWG1LSBD1                     710
#define CWG1REN                       711
#define REN                           712
#define CWG1SHUTDOWN                  713
#define SHUTDOWN                      714
#define CWG1AS1                       715
#define INAS                          716
#define CWG1INAS                      717
#define C1AS                          718
#define CWG1C1AS                      719
#define C2AS                          720
#define CWG1C2AS                      721
#define TMR2AS                        722
#define CWG1TMR2AS                    723
#define CWG1TMR4AS                    724
#define TMR4AS                        725
#define CWG1TMR6AS                    726
#define TMR6AS                        727
#define CWG1OCON0                     728
#define CWG1STRA                      729
#define STRA                          730
#define STRB                          731
#define CWG1STRB                      732
#define CWG1STRC                      733
#define STRC                          734
#define CWG1STRD                      735
#define STRD                          736
#define OVRA                          737
#define CWG1OVRA                      738
#define CWG1OVRB                      739
#define OVRB                          740
#define OVRC                          741
#define CWG1OVRC                      742
#define OVRD                          743
#define CWG1OVRD                      744
#define CWG1CON0                      745
#define CWG1MODE0                     746
#define CWG1CON0_MODE0                747
#define CWG1MODE                      748
#define CWG1CON0_MODE                 749
#define CWG1MODE1                     750
#define CWG1CON0_MODE1                751
#define CWG1MODE2                     752
#define CWG1CON0_MODE2                753
#define LD                            754
#define CWG1LD                        755
#define CWG1CON0_EN                   756
#define CWG1EN                        757
#define G1EN                          758
#define CWG1CON1                      759
#define CWG1POLA                      760
#define POLA                          761
#define CWG1POLB                      762
#define POLB                          763
#define CWG1POLC                      764
#define POLC                          765
#define CWG1POLD                      766
#define POLD                          767
#define IN                            768
#define CWG1IN                        769
#define CWG1OCON1                     770
#define CWG1OEA                       771
#define OEA                           772
#define CWG1OEB                       773
#define OEB                           774
#define CWG1OEC                       775
#define OEC                           776
#define CWG1OED                       777
#define OED                           778
#define CWG1CLKCON                    779
#define CS                            780
#define CWG1CS                        781
#define CWG1ISM                       782
#define CWG1IS                        783
#define IS                            784
#define IS0                           785
#define CWG1IS0                       786
#define CWG1IS1                       787
#define IS1                           788
#define IS2                           789
#define CWG1IS2                       790
#define WDTCON0                       791
#define SWDTEN                        792
#define SEN                           793
#define WDTSEN                        794
#define WDTPS                         795
#define WDTPS0                        796
#define WDTPS1                        797
#define WDTPS2                        798
#define WDTPS3                        799
#define WDTPS4                        800
#define WDTCON1                       801
#define WDTWINDOW0                    802
#define WINDOW0                       803
#define WINDOW                        804
#define WDTWINDOW                     805
#define WDTWINDOW1                    806
#define WINDOW1                       807
#define WDTWINDOW2                    808
#define WINDOW2                       809
#define WDTCS                         810
#define WDTCS0                        811
#define WDTCS1                        812
#define WDTCS2                        813
#define WDTPSL                        814
#define WDTPSL_WDTPSCNT               815
#define WDTPSL_PSCNT                  816
#define WDTPSCNT0                     817
#define PSCNT0                        818
#define WDTPSCNT1                     819
#define PSCNT1                        820
#define WDTPSCNT2                     821
#define PSCNT2                        822
#define WDTPSCNT3                     823
#define PSCNT3                        824
#define WDTPSCNT4                     825
#define PSCNT4                        826
#define WDTPSCNT5                     827
#define PSCNT5                        828
#define WDTPSCNT6                     829
#define PSCNT6                        830
#define WDTPSCNT7                     831
#define PSCNT7                        832
#define WDTPSH                        833
#define PSCNT8                        834
#define WDTPSH_WDTPSCNT               835
#define WDTPSH_PSCNT                  836
#define WDTPSCNT8                     837
#define PSCNT9                        838
#define WDTPSCNT9                     839
#define PSCNT10                       840
#define WDTPSCNT10                    841
#define PSCNT11                       842
#define WDTPSCNT11                    843
#define PSCNT12                       844
#define WDTPSCNT12                    845
#define PSCNT13                       846
#define WDTPSCNT13                    847
#define PSCNT14                       848
#define WDTPSCNT14                    849
#define PSCNT15                       850
#define WDTPSCNT15                    851
#define PSCNT16                       852
#define WDTPSCNT16                    853
#define WDTPSCNT17                    854
#define PSCNT17                       855
#define STATE                         856
#define WDTSTATE                      857
#define WDTTMR                        858
#define WDTTMR0                       859
#define WDTTMR1                       860
#define WDTTMR2                       861
#define WDTTMR3                       862
#define WDTTMR4                       863
#define SCANLADRL                     864
#define SCANLADRL_LADR                865
#define LDAR0                         866
#define SCANLADRL_SCANLADR            867
#define SCANLADR0                     868
#define SCANLADR1                     869
#define LDAR1                         870
#define LADR2                         871
#define SCANLADR2                     872
#define LADR3                         873
#define SCANLADR3                     874
#define LADR4                         875
#define SCANLADR4                     876
#define LADR5                         877
#define SCANLADR5                     878
#define SCANLADR6                     879
#define LADR6                         880
#define LADR7                         881
#define SCANLADR7                     882
#define SCANLADRH                     883
#define LADR8                         884
#define SCANLADRH_SCANLADR            885
#define SCANLADR8                     886
#define SCANLADRH_LADR                887
#define LADR9                         888
#define SCANLADR9                     889
#define LADR10                        890
#define SCANLADR10                    891
#define SCANLADR11                    892
#define LADR11                        893
#define LADR12                        894
#define SCANLADR12                    895
#define LADR13                        896
#define SCANLADR13                    897
#define LADR14                        898
#define SCANLADR14                    899
#define LADR15                        900
#define SCANLADR15                    901
#define SCANHADRL                     902
#define SCANHADR0                     903
#define HADR0                         904
#define SCANHADRL_HADR                905
#define SCANHADRL_SCANHADR            906
#define SCANHADR1                     907
#define HADR1                         908
#define SCANHADR2                     909
#define HARD2                         910
#define SCANHADR3                     911
#define HADR3                         912
#define SCANHADR4                     913
#define HADR4                         914
#define SCANHADR5                     915
#define HADR5                         916
#define SCANHADR6                     917
#define HADR6                         918
#define SCANHADR7                     919
#define HADR7                         920
#define SCANHADRH                     921
#define HADR8                         922
#define SCANHADRH_SCANHADR            923
#define SCANHADR8                     924
#define SCANHADRH_HADR                925
#define HADR9                         926
#define SCANHADR9                     927
#define HADR10                        928
#define SCANHADR10                    929
#define SCANHADR11                    930
#define HADR11                        931
#define HADR12                        932
#define SCANHADR12                    933
#define HADR13                        934
#define SCANHADR13                    935
#define HADR14                        936
#define SCANHADR14                    937
#define HADR15                        938
#define SCANHADR15                    939
#define SCANCON0                      940
#define SCANMODE                      941
#define SCANMODE0                     942
#define SCANCON0_MODE                 943
#define SCANCON0_MODE0                944
#define SCANCON0_MODE1                945
#define SCANMODE1                     946
#define INTM                          947
#define SCANINTM                      948
#define INVALID                       949
#define SCANINVALID                   950
#define SCANCON0_BUSY                 951
#define SCANBUSY                      952
#define SCANGO                        953
#define SCANEN                        954
#define SCANCON0_EN                   955
#define SCANTRIG                      956
#define TSEL0                         957
#define TSEL                          958
#define SCANTSEL0                     959
#define SCANTSEL                      960
#define TSEL1                         961
#define SCANTSEL1                     962
#define CRCDATL                       963
#define CRCDATL_DAT                   964
#define CRCDAT0                       965
#define DAT0                          966
#define CRCDATL_CRCDAT                967
#define CRCDAT1                       968
#define DAT1                          969
#define CRCDAT2                       970
#define DAT2                          971
#define CRCDAT3                       972
#define DAT3                          973
#define CRCDAT4                       974
#define DAT4                          975
#define CRCDAT5                       976
#define DAT5                          977
#define CRCDAT6                       978
#define DAT6                          979
#define DAT7                          980
#define CRDCDAT7                      981
#define CRCDATH                       982
#define CRCDAT8                       983
#define DAT8                          984
#define CRCDATH_CRCDAT                985
#define CRCDATH_DAT                   986
#define CRCDAT9                       987
#define DAT9                          988
#define DAT10                         989
#define CRCDAT10                      990
#define DAT11                         991
#define CRCDAT11                      992
#define DAT12                         993
#define CRCDAT12                      994
#define DAT13                         995
#define CRCDAT13                      996
#define DAT14                         997
#define CRCDAT14                      998
#define DAT15                         999
#define CRCDAT15                      1000
#define CRCACCL                       1001
#define CRCACC0                       1002
#define CRCACCL_ACC                   1003
#define CRCACCL_CRCACC                1004
#define ACC0                          1005
#define CRCACC1                       1006
#define ACC1                          1007
#define CRCACC2                       1008
#define ACC2                          1009
#define CRCACC3                       1010
#define ACC3                          1011
#define CRCACC4                       1012
#define ACC4                          1013
#define CRCACC5                       1014
#define ACC5                          1015
#define CRCACC6                       1016
#define ACC6                          1017
#define CRCACC7                       1018
#define ACC7                          1019
#define CRCACCH                       1020
#define CRCACCH_CRCACC                1021
#define CRCACC8                       1022
#define CRCACCH_ACC                   1023
#define ACC8                          1024
#define CRCACC9                       1025
#define ACC9                          1026
#define CRCACC10                      1027
#define ACC10                         1028
#define CRCACC11                      1029
#define ACC11                         1030
#define CRCACC12                      1031
#define ACC12                         1032
#define CRCACC13                      1033
#define ACC13                         1034
#define ACC14                         1035
#define CRCACC14                      1036
#define CRCACC15                      1037
#define ACC15                         1038
#define CRCSHIFTL                     1039
#define CRCSHIFTL_CRCSHIFT            1040
#define CRCSHIFTL_SHIFT               1041
#define SHIFT0                        1042
#define CRCSHIFT0                     1043
#define SHIFT1                        1044
#define CRCSHIFT1                     1045
#define SHIFT2                        1046
#define CRCSHIFT2                     1047
#define SHIFT3                        1048
#define CRCSHIFT3                     1049
#define SHIFT4                        1050
#define CRCSHIFT4                     1051
#define SHIFT5                        1052
#define CRCSHIFT5                     1053
#define SHIFT6                        1054
#define CRCSHIFT6                     1055
#define SHIFT7                        1056
#define CRCSHIFT7                     1057
#define CRCSHIFTH                     1058
#define CRCSHIFT8                     1059
#define CRCSHIFTH_SHIFT               1060
#define CRCSHIFTH_CRCSHIFT            1061
#define SHIFT8                        1062
#define CRCSHIFT9                     1063
#define SHIFT9                        1064
#define SHIFT10                       1065
#define CRCSHIFT10                    1066
#define SHIFT11                       1067
#define CRCSHIFT11                    1068
#define SHIFT12                       1069
#define CRCSHIFT12                    1070
#define SHIFT13                       1071
#define CRCSHIFT13                    1072
#define CRCSHIFT14                    1073
#define SHIFT14                       1074
#define SHIFT15                       1075
#define CRCSHIFT15                    1076
#define CRCXORL                       1077
#define XOR1                          1078
#define CRCXOR1                       1079
#define XOR2                          1080
#define CRCXOR2                       1081
#define XOR3                          1082
#define CRCXOR3                       1083
#define XOR4                          1084
#define CRCXOR4                       1085
#define XOR5                          1086
#define CRCXOR5                       1087
#define XOR6                          1088
#define CRCXOR6                       1089
#define XOR7                          1090
